SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_vdac.h
/* Bit fields for VDAC CMD */
#define _VDAC_CMD_RESETVALUE                    0x00000000UL                            /**< Default value for VDAC_CMD                  */
#define _VDAC_CMD_MASK                          0x00000F33UL                            /**< Mask for VDAC_CMD                           */
#define VDAC_CMD_CH0EN                          (0x1UL << 0)                            /**< DAC Channel 0 Enable                        */
#define _VDAC_CMD_CH0EN_SHIFT                   0                                       /**< Shift value for VDAC_CH0EN                  */
#define _VDAC_CMD_CH0EN_MASK                    0x1UL                                   /**< Bit mask for VDAC_CH0EN                     */
#define _VDAC_CMD_CH0EN_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for VDAC_CMD                   */
#define VDAC_CMD_CH0EN_DEFAULT                  (_VDAC_CMD_CH0EN_DEFAULT << 0)          /**< Shifted mode DEFAULT for VDAC_CMD           */
#define VDAC_CMD_CH0DIS                         (0x1UL << 1)                            /**< DAC Channel 0 Disable                       */
#define _VDAC_CMD_CH0DIS_SHIFT                  1                                       /**< Shift value for VDAC_CH0DIS                 */
#define _VDAC_CMD_CH0DIS_MASK                   0x2UL                                   /**< Bit mask for VDAC_CH0DIS                    */
#define _VDAC_CMD_CH0DIS_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for VDAC_CMD                   */
#define VDAC_CMD_CH0DIS_DEFAULT                 (_VDAC_CMD_CH0DIS_DEFAULT << 1)         /**< Shifted mode DEFAULT for VDAC_CMD           */
#define VDAC_CMD_CH1EN                          (0x1UL << 4)                            /**< DAC Channel 1 Enable                        */
#define _VDAC_CMD_CH1EN_SHIFT                   4                                       /**< Shift value for VDAC_CH1EN                  */
#define _VDAC_CMD_CH1EN_MASK                    0x10UL                                  /**< Bit mask for VDAC_CH1EN                     */
#define _VDAC_CMD_CH1EN_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for VDAC_CMD                   */
#define VDAC_CMD_CH1EN_DEFAULT                  (_VDAC_CMD_CH1EN_DEFAULT << 4)          /**< Shifted mode DEFAULT for VDAC_CMD           */
#define VDAC_CMD_CH1DIS                         (0x1UL << 5)                            /**< DAC Channel 1 Disable                       */
#define _VDAC_CMD_CH1DIS_SHIFT                  5                                       /**< Shift value for VDAC_CH1DIS                 */
#define _VDAC_CMD_CH1DIS_MASK                   0x20UL                                  /**< Bit mask for VDAC_CH1DIS                    */
#define _VDAC_CMD_CH1DIS_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for VDAC_CMD                   */
#define VDAC_CMD_CH1DIS_DEFAULT                 (_VDAC_CMD_CH1DIS_DEFAULT << 5)         /**< Shifted mode DEFAULT for VDAC_CMD           */
#define VDAC_CMD_CH0FIFOFLUSH                   (0x1UL << 8)                            /**< CH0 WFIFO Flush                             */
#define _VDAC_CMD_CH0FIFOFLUSH_SHIFT            8                                       /**< Shift value for VDAC_CH0FIFOFLUSH           */
#define _VDAC_CMD_CH0FIFOFLUSH_MASK             0x100UL                                 /**< Bit mask for VDAC_CH0FIFOFLUSH              */
#define _VDAC_CMD_CH0FIFOFLUSH_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for VDAC_CMD                   */
#define VDAC_CMD_CH0FIFOFLUSH_DEFAULT           (_VDAC_CMD_CH0FIFOFLUSH_DEFAULT << 8)   /**< Shifted mode DEFAULT for VDAC_CMD           */
#define VDAC_CMD_CH1FIFOFLUSH                   (0x1UL << 9)                            /**< CH1 WFIFO Flush                             */
#define _VDAC_CMD_CH1FIFOFLUSH_SHIFT            9                                       /**< Shift value for VDAC_CH1FIFOFLUSH           */
#define _VDAC_CMD_CH1FIFOFLUSH_MASK             0x200UL                                 /**< Bit mask for VDAC_CH1FIFOFLUSH              */
#define _VDAC_CMD_CH1FIFOFLUSH_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for VDAC_CMD                   */
#define VDAC_CMD_CH1FIFOFLUSH_DEFAULT           (_VDAC_CMD_CH1FIFOFLUSH_DEFAULT << 9)   /**< Shifted mode DEFAULT for VDAC_CMD           */
#define VDAC_CMD_SINEMODESTART                  (0x1UL << 10)                           /**< Start Sine Wave Generation                  */
#define _VDAC_CMD_SINEMODESTART_SHIFT           10                                      /**< Shift value for VDAC_SINEMODESTART          */
#define _VDAC_CMD_SINEMODESTART_MASK            0x400UL                                 /**< Bit mask for VDAC_SINEMODESTART             */
#define _VDAC_CMD_SINEMODESTART_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for VDAC_CMD                   */
#define VDAC_CMD_SINEMODESTART_DEFAULT          (_VDAC_CMD_SINEMODESTART_DEFAULT << 10) /**< Shifted mode DEFAULT for VDAC_CMD           */
#define VDAC_CMD_SINEMODESTOP                   (0x1UL << 11)                           /**< Stop Sine Wave Generation                   */
#define _VDAC_CMD_SINEMODESTOP_SHIFT            11                                      /**< Shift value for VDAC_SINEMODESTOP           */
#define _VDAC_CMD_SINEMODESTOP_MASK             0x800UL                                 /**< Bit mask for VDAC_SINEMODESTOP              */
#define _VDAC_CMD_SINEMODESTOP_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for VDAC_CMD                   */
#define VDAC_CMD_SINEMODESTOP_DEFAULT           (_VDAC_CMD_SINEMODESTOP_DEFAULT << 11)  /**< Shifted mode DEFAULT for VDAC_CMD           */

/* Bit fields for VDAC IF */
#define _VDAC_IF_RESETVALUE                     0x00000000UL                            /**< Default value for VDAC_IF                   */
#define _VDAC_IF_MASK                           0x04340333UL                            /**< Mask for VDAC_IF                            */
#define VDAC_IF_CH0CD                           (0x1UL << 0)                            /**< CH0 Conversion Done Interrupt Flag          */
#define _VDAC_IF_CH0CD_SHIFT                    0                                       /**< Shift value for VDAC_CH0CD                  */
#define _VDAC_IF_CH0CD_MASK                     0x1UL                                   /**< Bit mask for VDAC_CH0CD                     */
#define _VDAC_IF_CH0CD_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for VDAC_IF                    */
#define VDAC_IF_CH0CD_DEFAULT                   (_VDAC_IF_CH0CD_DEFAULT << 0)           /**< Shifted mode DEFAULT for VDAC_IF            */
#define VDAC_IF_CH1CD                           (0x1UL << 1)                            /**< CH1 Conversion Done Interrupt Flag          */
#define _VDAC_IF_CH1CD_SHIFT                    1                                       /**< Shift value for VDAC_CH1CD                  */
#define _VDAC_IF_CH1CD_MASK                     0x2UL                                   /**< Bit mask for VDAC_CH1CD                     */
#define _VDAC_IF_CH1CD_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for VDAC_IF                    */
#define VDAC_IF_CH1CD_DEFAULT                   (_VDAC_IF_CH1CD_DEFAULT << 1)           /**< Shifted mode DEFAULT for VDAC_IF            */
#define VDAC_IF_CH0OF                           (0x1UL << 4)                            /**< CH0 Data Overflow Interrupt Flag            */
#define _VDAC_IF_CH0OF_SHIFT                    4                                       /**< Shift value for VDAC_CH0OF                  */
#define _VDAC_IF_CH0OF_MASK                     0x10UL                                  /**< Bit mask for VDAC_CH0OF                     */
#define _VDAC_IF_CH0OF_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for VDAC_IF                    */
#define VDAC_IF_CH0OF_DEFAULT                   (_VDAC_IF_CH0OF_DEFAULT << 4)           /**< Shifted mode DEFAULT for VDAC_IF            */
#define VDAC_IF_CH1OF                           (0x1UL << 5)                            /**< CH1 Data Overflow Interrupt Flag            */
#define _VDAC_IF_CH1OF_SHIFT                    5                                       /**< Shift value for VDAC_CH1OF                  */
#define _VDAC_IF_CH1OF_MASK                     0x20UL                                  /**< Bit mask for VDAC_CH1OF                     */
#define _VDAC_IF_CH1OF_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for VDAC_IF                    */
#define VDAC_IF_CH1OF_DEFAULT                   (_VDAC_IF_CH1OF_DEFAULT << 5)           /**< Shifted mode DEFAULT for VDAC_IF            */
#define VDAC_IF_CH0UF                           (0x1UL << 8)                            /**< CH0 Data Underflow Interrupt Flag           */
#define _VDAC_IF_CH0UF_SHIFT                    8                                       /**< Shift value for VDAC_CH0UF                  */
#define _VDAC_IF_CH0UF_MASK                     0x100UL                                 /**< Bit mask for VDAC_CH0UF                     */
#define _VDAC_IF_CH0UF_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for VDAC_IF                    */
#define VDAC_IF_CH0UF_DEFAULT                   (_VDAC_IF_CH0UF_DEFAULT << 8)           /**< Shifted mode DEFAULT for VDAC_IF            */
#define VDAC_IF_CH1UF                           (0x1UL << 9)                            /**< CH1 Data Underflow Interrupt Flag           */
#define _VDAC_IF_CH1UF_SHIFT                    9                                       /**< Shift value for VDAC_CH1UF                  */
#define _VDAC_IF_CH1UF_MASK                     0x200UL                                 /**< Bit mask for VDAC_CH1UF                     */
#define _VDAC_IF_CH1UF_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for VDAC_IF                    */
#define VDAC_IF_CH1UF_DEFAULT                   (_VDAC_IF_CH1UF_DEFAULT << 9)           /**< Shifted mode DEFAULT for VDAC_IF            */
#define VDAC_IF_ABUSALLOCERR                    (0x1UL << 18)                           /**< ABUS Port Allocation Error Flag             */
#define _VDAC_IF_ABUSALLOCERR_SHIFT             18                                      /**< Shift value for VDAC_ABUSALLOCERR           */
#define _VDAC_IF_ABUSALLOCERR_MASK              0x40000UL                               /**< Bit mask for VDAC_ABUSALLOCERR              */
#define _VDAC_IF_ABUSALLOCERR_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for VDAC_IF                    */
#define VDAC_IF_ABUSALLOCERR_DEFAULT            (_VDAC_IF_ABUSALLOCERR_DEFAULT << 18)   /**< Shifted mode DEFAULT for VDAC_IF            */
#define VDAC_IF_CH0DVL                          (0x1UL << 20)                           /**< CH0 Data Valid Level Interrupt Flag         */
#define _VDAC_IF_CH0DVL_SHIFT                   20                                      /**< Shift value for VDAC_CH0DVL                 */
#define _VDAC_IF_CH0DVL_MASK                    0x100000UL                              /**< Bit mask for VDAC_CH0DVL                    */
#define _VDAC_IF_CH0DVL_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for VDAC_IF                    */
#define VDAC_IF_CH0DVL_DEFAULT                  (_VDAC_IF_CH0DVL_DEFAULT << 20)         /**< Shifted mode DEFAULT for VDAC_IF            */
#define VDAC_IF_CH1DVL                          (0x1UL << 21)                           /**< CH1 Data Valid Level Interrupt Flag         */
#define _VDAC_IF_CH1DVL_SHIFT                   21                                      /**< Shift value for VDAC_CH1DVL                 */
#define _VDAC_IF_CH1DVL_MASK                    0x200000UL                              /**< Bit mask for VDAC_CH1DVL                    */
#define _VDAC_IF_CH1DVL_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for VDAC_IF                    */
#define VDAC_IF_CH1DVL_DEFAULT                  (_VDAC_IF_CH1DVL_DEFAULT << 21)         /**< Shifted mode DEFAULT for VDAC_IF            */
#define VDAC_IF_ABUSINPUTCONFLICT               (0x1UL << 26)                           /**< ABUS Input Conflict Error Flag              */
#define _VDAC_IF_ABUSINPUTCONFLICT_SHIFT        26                                      /**< Shift value for VDAC_ABUSINPUTCONFLICT      */
#define _VDAC_IF_ABUSINPUTCONFLICT_MASK         0x4000000UL                             /**< Bit mask for VDAC_ABUSINPUTCONFLICT         */
#define _VDAC_IF_ABUSINPUTCONFLICT_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for VDAC_IF                    */
#define VDAC_IF_ABUSINPUTCONFLICT_DEFAULT       (_VDAC_IF_ABUSINPUTCONFLICT_DEFAULT << 26) /**< Shifted mode DEFAULT for VDAC_IF            */

/* Bit fields for VDAC IEN */
#define _VDAC_IEN_RESETVALUE                    0x00000000UL                            /**< Default value for VDAC_IEN                  */
#define _VDAC_IEN_MASK                          0x04340333UL                            /**< Mask for VDAC_IEN                           */
#define VDAC_IEN_CH0CD                          (0x1UL << 0)                            /**< CH0 Conversion Done Interrupt Flag          */
#define _VDAC_IEN_CH0CD_SHIFT                   0                                       /**< Shift value for VDAC_CH0CD                  */
#define _VDAC_IEN_CH0CD_MASK                    0x1UL                                   /**< Bit mask for VDAC_CH0CD                     */
#define _VDAC_IEN_CH0CD_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for VDAC_IEN                   */
#define VDAC_IEN_CH0CD_DEFAULT                  (_VDAC_IEN_CH0CD_DEFAULT << 0)          /**< Shifted mode DEFAULT for VDAC_IEN           */
#define VDAC_IEN_CH1CD                          (0x1UL << 1)                            /**< CH1 Conversion Done Interrupt Flag          */
#define _VDAC_IEN_CH1CD_SHIFT                   1                                       /**< Shift value for VDAC_CH1CD                  */
#define _VDAC_IEN_CH1CD_MASK                    0x2UL                                   /**< Bit mask for VDAC_CH1CD                     */
#define _VDAC_IEN_CH1CD_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for VDAC_IEN                   */
#define VDAC_IEN_CH1CD_DEFAULT                  (_VDAC_IEN_CH1CD_DEFAULT << 1)          /**< Shifted mode DEFAULT for VDAC_IEN           */
#define VDAC_IEN_CH0OF                          (0x1UL << 4)                            /**< CH0 Data Overflow Interrupt Flag            */
#define _VDAC_IEN_CH0OF_SHIFT                   4                                       /**< Shift value for VDAC_CH0OF                  */
#define _VDAC_IEN_CH0OF_MASK                    0x10UL                                  /**< Bit mask for VDAC_CH0OF                     */
#define _VDAC_IEN_CH0OF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for VDAC_IEN                   */
#define VDAC_IEN_CH0OF_DEFAULT                  (_VDAC_IEN_CH0OF_DEFAULT << 4)          /**< Shifted mode DEFAULT for VDAC_IEN           */
#define VDAC_IEN_CH1OF                          (0x1UL << 5)                            /**< CH1 Data Overflow Interrupt Flag            */
#define _VDAC_IEN_CH1OF_SHIFT                   5                                       /**< Shift value for VDAC_CH1OF                  */
#define _VDAC_IEN_CH1OF_MASK                    0x20UL                                  /**< Bit mask for VDAC_CH1OF                     */
#define _VDAC_IEN_CH1OF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for VDAC_IEN                   */
#define VDAC_IEN_CH1OF_DEFAULT                  (_VDAC_IEN_CH1OF_DEFAULT << 5)          /**< Shifted mode DEFAULT for VDAC_IEN           */
#define VDAC_IEN_CH0UF                          (0x1UL << 8)                            /**< CH0 Data Underflow Interrupt Flag           */
#define _VDAC_IEN_CH0UF_SHIFT                   8                                       /**< Shift value for VDAC_CH0UF                  */
#define _VDAC_IEN_CH0UF_MASK                    0x100UL                                 /**< Bit mask for VDAC_CH0UF                     */
#define _VDAC_IEN_CH0UF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for VDAC_IEN                   */
#define VDAC_IEN_CH0UF_DEFAULT                  (_VDAC_IEN_CH0UF_DEFAULT << 8)          /**< Shifted mode DEFAULT for VDAC_IEN           */
#define VDAC_IEN_CH1UF                          (0x1UL << 9)                            /**< CH1 Data Underflow Interrupt Flag           */
#define _VDAC_IEN_CH1UF_SHIFT                   9                                       /**< Shift value for VDAC_CH1UF                  */
#define _VDAC_IEN_CH1UF_MASK                    0x200UL                                 /**< Bit mask for VDAC_CH1UF                     */
#define _VDAC_IEN_CH1UF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for VDAC_IEN                   */
#define VDAC_IEN_CH1UF_DEFAULT                  (_VDAC_IEN_CH1UF_DEFAULT << 9)          /**< Shifted mode DEFAULT for VDAC_IEN           */
#define VDAC_IEN_ABUSALLOCERR                   (0x1UL << 18)                           /**< ABUS Allocation Error Interrupt Flag        */
#define _VDAC_IEN_ABUSALLOCERR_SHIFT            18                                      /**< Shift value for VDAC_ABUSALLOCERR           */
#define _VDAC_IEN_ABUSALLOCERR_MASK             0x40000UL                               /**< Bit mask for VDAC_ABUSALLOCERR              */
#define _VDAC_IEN_ABUSALLOCERR_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for VDAC_IEN                   */
#define VDAC_IEN_ABUSALLOCERR_DEFAULT           (_VDAC_IEN_ABUSALLOCERR_DEFAULT << 18)  /**< Shifted mode DEFAULT for VDAC_IEN           */
#define VDAC_IEN_CH0DVL                         (0x1UL << 20)                           /**< CH0 Data Valid Level Interrupt Flag         */
#define _VDAC_IEN_CH0DVL_SHIFT                  20                                      /**< Shift value for VDAC_CH0DVL                 */
#define _VDAC_IEN_CH0DVL_MASK                   0x100000UL                              /**< Bit mask for VDAC_CH0DVL                    */
#define _VDAC_IEN_CH0DVL_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for VDAC_IEN                   */
#define VDAC_IEN_CH0DVL_DEFAULT                 (_VDAC_IEN_CH0DVL_DEFAULT << 20)        /**< Shifted mode DEFAULT for VDAC_IEN           */
#define VDAC_IEN_CH1DVL                         (0x1UL << 21)                           /**< CH1 Data Valid Level Interrupt Flag         */
#define _VDAC_IEN_CH1DVL_SHIFT                  21                                      /**< Shift value for VDAC_CH1DVL                 */
#define _VDAC_IEN_CH1DVL_MASK                   0x200000UL                              /**< Bit mask for VDAC_CH1DVL                    */
#define _VDAC_IEN_CH1DVL_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for VDAC_IEN                   */
#define VDAC_IEN_CH1DVL_DEFAULT                 (_VDAC_IEN_CH1DVL_DEFAULT << 21)        /**< Shifted mode DEFAULT for VDAC_IEN           */
#define VDAC_IEN_ABUSINPUTCONFLICT              (0x1UL << 26)                           /**< ABUS Input Conflict Interrupt Flag          */
#define _VDAC_IEN_ABUSINPUTCONFLICT_SHIFT       26                                      /**< Shift value for VDAC_ABUSINPUTCONFLICT      */
#define _VDAC_IEN_ABUSINPUTCONFLICT_MASK        0x4000000UL                             /**< Bit mask for VDAC_ABUSINPUTCONFLICT         */
#define _VDAC_IEN_ABUSINPUTCONFLICT_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for VDAC_IEN                   */
#define VDAC_IEN_ABUSINPUTCONFLICT_DEFAULT      (_VDAC_IEN_ABUSINPUTCONFLICT_DEFAULT << 26) /**< Shifted mode DEFAULT for VDAC_IEN           */

/* Bit fields for VDAC CH0F */
#define _VDAC_CH0F_RESETVALUE                   0x00000000UL                            /**< Default value for VDAC_CH0F                 */
#define _VDAC_CH0F_MASK                         0x00000FFFUL                            /**< Mask for VDAC_CH0F                          */
#define _VDAC_CH0F_DATA_SHIFT                   0                                       /**< Shift value for VDAC_DATA                   */
#define _VDAC_CH0F_DATA_MASK                    0xFFFUL                                 /**< Bit mask for VDAC_DATA                      */
#define _VDAC_CH0F_DATA_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for VDAC_CH0F                  */
#define VDAC_CH0F_DATA_DEFAULT                  (_VDAC_CH0F_DATA_DEFAULT << 0)          /**< Shifted mode DEFAULT for VDAC_CH0F          */

/* Bit fields for VDAC CH1F */
#define _VDAC_CH1F_RESETVALUE                   0x00000000UL                            /**< Default value for VDAC_CH1F                 */
#define _VDAC_CH1F_MASK                         0x00000FFFUL                            /**< Mask for VDAC_CH1F                          */
#define _VDAC_CH1F_DATA_SHIFT                   0                                       /**< Shift value for VDAC_DATA                   */
#define _VDAC_CH1F_DATA_MASK                    0xFFFUL                                 /**< Bit mask for VDAC_DATA                      */
#define _VDAC_CH1F_DATA_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for VDAC_CH1F                  */
#define VDAC_CH1F_DATA_DEFAULT                  (_VDAC_CH1F_DATA_DEFAULT << 0)          /**< Shifted mode DEFAULT for VDAC_CH1F          */

